## Production: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                   |
|--------|--------------------------------------------------------------------------|
| add    | `aws_athena_data_catalog.rds_data_catalog`                               |
|        | `aws_serverlessapplicationrepository_cloudformation_stack.rds_connector` |
| update | `aws_iam_role_policy.athena_dynamodb_policy`                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_function.rds_existing will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_function" "rds_existing" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + code_signing_config_arn        = (known after apply)
      + dead_letter_config             = (known after apply)
      + description                    = (known after apply)
      + environment                    = (known after apply)
      + ephemeral_storage              = (known after apply)
      + file_system_config             = (known after apply)
      + function_name                  = "rds-lambda-connector"
      + handler                        = (known after apply)
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + logging_config                 = (known after apply)
      + memory_size                    = (known after apply)
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = (known after apply)
      + role                           = (known after apply)
      + runtime                        = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = (known after apply)
      + timeout                        = (known after apply)
      + tracing_config                 = (known after apply)
      + version                        = (known after apply)
      + vpc_config                     = (known after apply)
    }

  # aws_athena_data_catalog.rds_data_catalog will be created
  + resource "aws_athena_data_catalog" "rds_data_catalog" {
      + arn         = (known after apply)
      + description = "Athena-RDS data catalog"
      + id          = (known after apply)
      + name        = "rds"
      + parameters  = (known after apply)
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + type        = "LAMBDA"
    }

  # aws_iam_role_policy.athena_dynamodb_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "athena_dynamodb_policy" {
        id          = "athena_dynamodb_role:athena_dynamodb_policy"
        name        = "athena_dynamodb_policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "logs:CreateLogGroup",
                            "logs:CreateLogStream",
                            "logs:PutLogEvents",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                  ~ {
                      ~ Action   = [
                            # (7 unchanged elements hidden)
                            "glue:GetDatabase",
                          + "glue:ListSchemas",
                            "athena:GetQueryExecution",
                            # (1 unchanged element hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action   = [
                            "dynamodb:DescribeTable",
                          - "dynamodb:ListSchemas",
                            "dynamodb:ListTables",
                            # (3 unchanged elements hidden)
                        ]
                      ~ Resource = "arn:aws:dynamodb:ca-central-1:957818836222:table/AuditLogs" -> [
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/AuditLogs",
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/auditlogs",
                        ]
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "dynamodb:ListTables",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                    {
                        Action   = [
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:kms:ca-central-1:957818836222:key/afbaea67-8277-4a4c-853e-7697dd2dade5"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_serverlessapplicationrepository_cloudformation_stack.rds_connector will be created
  + resource "aws_serverlessapplicationrepository_cloudformation_stack" "rds_connector" {
      + application_id   = "arn:aws:serverlessrepo:us-east-1:292517598671:applications/AthenaPostgreSQLConnector"
      + capabilities     = [
          + "CAPABILITY_IAM",
          + "CAPABILITY_RESOURCE_POLICY",
        ]
      + id               = (known after apply)
      + name             = "rds-connector"
      + outputs          = (known after apply)
      + parameters       = {
          + "DefaultConnectionString" = (sensitive value)
          + "LambdaFunctionName"      = "rds-lambda-connector"
          + "SecretNamePrefix"        = "rds-connector"
          + "SecurityGroupIds"        = "sg-0603a6edcc9e34d98"
          + "SpillBucket"             = "gc-forms-production-athena-spill-bucket"
          + "SubnetIds"               = "subnet-066cf27132a20a02a,subnet-05b9cd59ad60e88af,subnet-025adc92b0ee815ba"
        }
      + semantic_version = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.rds_data_catalog"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.codedeploy_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ELB_5xx_error_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_login_outside_canada_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_signin_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_forms_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_form_archiver_invocations"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_nagware_invocations_schedule"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_response_archiver_invocations"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
